ERP.belugaerp/src/Enums/СтатусыПриходныхОрдеров/СтатусыПриходныхОрдеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыПриходныхОрдеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Принят</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ТребуетсяОбработка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Documents/ПриходныйОрдерНаТовары/ПриходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПриходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_ЕстьАлкогольнаяПродукция</name>
    <comment>// Признак что требуется ТТН</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЕстьМаркируемаяАлкогольнаяПродукция</name>
    <comment>// Признак что требуются марки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НеАктуализироватьЗаказыКлиентовПоРезервам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Приоритет</name>
    <type>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_РазрешитьПараллельнуюСборку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипПриемки</name>
    <type>
      <types>CatalogRef.битТипыПриемкиWMS</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗонаПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/CommonModules/бг_алкАктКТоварноТранспортнойНакладнойЕГАИСИнтеграция/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьЗагружаемыйОбъект(ЗагружаемыйОбъект, СтруктураОбъекта, СписокСвойств, 
			ИсключаяСвойства, СтандартнаяОбработка) Экспорт

	СтандартнаяОбработка = Ложь;		

	ВидДокумента = бг_ОбщегоНазначенияСервер.ЗначениеПеречисленияИзСтруктурыОбъекта(СтруктураОбъекта, "ВидДокумента");	
	ВидАкта = бг_ОбщегоНазначенияСервер.ЗначениеПеречисленияИзСтруктурыОбъекта(СтруктураОбъекта, "ВидАкта");
	СтатусДокумента = бг_ОбщегоНазначенияСервер.ЗначениеПеречисленияИзСтруктурыОбъекта(СтруктураОбъекта, "СтатусДокумента");	
	
	ЗагружаемыйОбъект = Новый Массив;
	
	Если СтрСравнить(ВидДокумента, "Исходящий") <> 0 Тогда
		// Обрабатываем только исходящие акты.
		Возврат;
	КонецЕсли;

	Если СтрСравнить(ВидАкта, "АктПодтверждения") = 0 
		И СтрСравнить(СтатусДокумента, "Подтвержден") = 0 Тогда
		ОтразитьАктПодтвержденияПоУчетнымДокументам(СтруктураОбъекта);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // Конец ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Процедура ОтразитьАктПодтвержденияПоУчетнымДокументам(СтруктураОбъекта)
	
	УчетныеДокументы = УчетныеДокументы(СтруктураОбъекта);
	
	Для каждого УчетныйДокумент Из УчетныеДокументы Цикл
		Если ТипЗнч(УчетныйДокумент) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
			ОформитьПриходныйОрдерПоПриобретению(УчетныйДокумент);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Возвращаеи массив ссылок на учетные документы ЕГАИС.
//
Функция УчетныеДокументы(СтруктураОбъекта)
	
	Перем адаптер_РаботаСДаннымиИБ;    
	адаптер_РаботаСДаннымиИБ = ОбщегоНазначения.ОбщийМодуль("адаптер_РаботаСДаннымиИБ");
	
	СсылкиНаУчетныеДокументы = Новый Массив;		
	
	УчетныеДокументы = Неопределено;
	СтруктураОбъекта.Свойство("УчетныеДокументы", УчетныеДокументы); 
			
	Если ТипЗнч(УчетныеДокументы) = Тип("Массив") Тогда
		Для каждого СтрокаТЧ Из УчетныеДокументы Цикл
			УчетныйДокументСсылка = адаптер_РаботаСДаннымиИБ.НайтиСсылкуПоЗагружаемымДанным(СтрокаТЧ.УчетныйДокумент);
			Если адаптер_РаботаСДаннымиИБ.СсылкаСуществует(УчетныйДокументСсылка) Тогда
				СсылкиНаУчетныеДокументы.Добавить(УчетныйДокументСсылка);	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СсылкиНаУчетныеДокументы;
	
КонецФункции	

Процедура ОформитьПриходныйОрдерПоПриобретению(УчетныйДокумент)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Распоряжение", УчетныйДокумент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
	|ГДЕ
	|	ПриходныйОрдерНаТовары.Распоряжение = &Распоряжение
	|	И ПриходныйОрдерНаТовары.Проведен
	|	И ПриходныйОрдерНаТовары.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.Принят)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПриходныйОрдерОбъект = Выборка.Ссылка.ПолучитьОбъект();		
		ПриходныйОрдерОбъект.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят;
		ПриходныйОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти
